import 'package:cloud_firestore/cloud_firestore.dart';

Future<void> uploadCategoriesData() async {
  final firestore = FirebaseFirestore.instance;

  // Define the data with the correct type Map<String, dynamic>
  final List<Map<String, dynamic>> categoriesData =
  [
    {
      "name": "ডা: কে এম নাহিদ-উল হক",
      "address": "ডায়াবেটিস, থাইরয়েড, হরমোন বিশেষজ্ঞ\nসহকারী অধ্যাপক\nএন্ডোক্রাইনোলজি এন্ড ডায়াবেটোলজি বিভাগ\nডায়াবেটিস এসোসিয়েশন মেডিকেল কলেজ এন্ড হাসপাতাল, ফরিদপুর。\nচেম্বারঃ সিটি ডেন্টাল সার্জারী\nমুজিব সড়ক, নিলটুলী, ফরিদপুর (আরোগ্য সদন হাসপাতালের সামনে ২য় তলা)\nরোগী দেখার সময়ঃ বিকাল ০৫.৩০টা থেকে রাত ৮টা",
      "phone": ["01771994455", "01712025078"]
    },
    {
      "name": "ডাঃ দেলোয়ার হোসেন",
      "address": "বি.ডি.এস, এম.সি.পি.এস, বিসিএস, এফসিপিএস(ডেন্ট্রাল অর্থোডন্টিক্স)\nরোগী দেখার সময়ঃ প্রতি শুক্রবার সকাল ৯ টা থেকে ১২ টা পর্যন্ত。\nচেম্বারঃ মা ফার্মেসী, আরোগ্য সদন হাসপাতালের সামনে,মুজিব সড়ক,নিলটুলী,ফরিদপুর",
      "phone": ["0171125078"]
    },
    {
      "name": "ডা: গনপতি বিশ্বাস (শুভ)",
      "address": "সময় প্রতিদিন বিকাল ৩টা থেকে রাত ৯টা।\nশুক্রবার শুধুমাত্র সকাল ১০টা থেকে দুপুর ২টা ৩০ পর্যন্ত।",
      "phone": ["01790716191", "01762872928"]
    },
    {
      "name": "ডাঃ জাবেদ আলম",
      "address": "বিডিএস\nচেম্বারঃ লুমিনাস ডেন্টাল এন্ড মেডিকেল কেয়ার\nমসজিদ বাড়ী সড়ক, (ভাঙ্গারী পট্টি) ডায়াবেটিক হাসপাতালের মোড়, ঝিলটুলি, ফরিদপুর",
      "phone": ["01951350310", "01782386201"]
    },
    {
      "name": "ডাঃ অনন্যা সাহা",
      "address": "বিডিএস\nচেম্বারঃ ইয়োর ডেন্টিস্ট ফর কিওর এন্ড কেয়ার\n১নং আজিজ ম্যানশন (২য় তলা)\nনিলটুলি, ফরিদপুর। (ডায়াবেটিক হাসপাতালের অপর পার্শ্বে)",
      "phone": ["01710321915"]
    },
    {
      "name": "ডাঃ শেখ মোঃ শাহনুর রহমান (শাহীন)",
      "address": "বিডিএস,বিসিএস (স্বাস্থ্য)\nচেম্বারঃ ওরোসেভ ডেন্টাল কেয়ার\nথানা রোড, চকবাজার, (সাধনা ঔষুধালয়-এর পূর্ব পার্শ্বে), ফরিদপুর。",
      "phone": ["01712021259"]
    },
    {
      "name": "ডাঃ রুকসানা পারভীন",
      "address": "বিডিএস, পিজিটি\nচেম্বারঃ ফরিদপুর স্পেশালাইজড ডেন্টাল কেয়ার\nসারদা সুন্দরী স্কুল মার্কেট (২য় তলা),ভাঙ্গা রাস্তার মোড়, ফরিদপুর。",
      "phone": ["01307771014"]
    },
    {
      "name": "ডাঃ হৃদয় রায়",
      "address": "বিডিএস, পিজিটি\nচেম্বারঃ স্মাইল হ্যাভেন ডেন্টাল\nরায় ভবন (নিচ তলা), ২৫নং মুজিব সড়ক, নিলটুল , ফরিদপুর।\nস্পেশাল ডেন্টাল কেয়ার。",
      "phone": ["01723540049"]
    },
    {
      "name": "ডাক্তার মির আশিকুজ্জামান পলাশ",
      "address": "ডায়াবেটিক হসপিটাল এর পাশে। সেন্ট্রাল হসপিটাল এর সামনে। ঝিলটুলি",
      "phone": ["01775255662"]
    },
    {
      "name": "ডাক্তার সাবিহা শর্মী",
      "address": "ডায়াবেটিক হসপিটাল এর পাশে। সেন্ট্রাল হসপিটাল এর সামনে। ঝিলটুলি",
      "phone": ["01775255662"]
    }
  ]











  ;

  // Adding each categories entry to Firestore under the "faridpur/categories" document
  for (var categories in categoriesData) {
    final categoriesName = categories['name'] as String;
    //change the categories name
    await firestore.collection('faridpur').doc('বিশেষজ্ঞ ডাক্তার').set({
      categoriesName: {
        "name": categoriesName,
        "address": categories['address'] ?? "",
        "phone": categories['phone'] ?? [],
      }
    }, SetOptions(merge: true));
  }
}
